Revit 2027 API
CableTraySizes.ClearAll Method
 Removes all MEPSizes in the cable tray sizes.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ClearAll()
Public Sub ClearAll
public:
void ClearAll()
member ClearAll : unit -> unit
See Also
Reference
CableTraySizes Class
Autodesk.Revit.DB.Electrical Namespace